[{"name":"Adaptability","effect":"This Pokemon's attacks that receive STAB (Same Type Attack Bonus) are increased from 50% to 100%."},{"name":"Aerilate","effect":"All of this Pokemon's Normal-typed moves are now Flying-type."},{"name":"Aftermath","effect":"All of this Pokemon's Normal-typed moves are now Flying-type."},{"name":"Air Lock","effect":"While this Pokemon is active, all weather conditions and their effects are disabled."},{"name":"Analytic","effect":"If the user goes after the opponent, the power of the user's attack receives a 30% boost."},{"name":"Anger Point","effect":"If this Pokemon, or its Substitute, is struck by a Critical Hit, its Attack is boosted by six stages."},{"name":"Anticipation","effect":"A warning is displayed if an opposing Pokemon has the moves Selfdestruct, Explosion, Fissure, Guillotine, Horn Drill, Sheer Cold or any move from a type that is considered Super Effective against this Pokemon. Hidden Power, Judgment, Natural Gift and Weather Ball are viewed as Normal-type moves; Counter, Mirror Coat and Metal Burst do not receive warnings."},{"name":"Arena Trap","effect":"When this Pokemon enters the field, its opponents cannot switch or flee the battle unless they are part Flying-type, have the Levitate ability, are holding Shed Shell, or they use the moves Baton Pass or U-Turn. Flying-type and Levitate Pokemon cannot escape if they are holding Iron Ball or Gravity is in effect. Levitate Pokemon also cannot escape if their ability is disabled through other means, such as Skill Swap or Gastro Acid.\r\n[Field Effect]  If this Pokemon is in the lead spot, the rate of wild Pokemon battles is doubled."},{"name":"Aroma Veil","effect":"Protects allied Pokemon from the effects of Taunt and Torment."},{"name":"Aura Break","effect":"Reverses the effect of Fairy Aura and Dark Aura."},{"name":"Bad Dreams","effect":"If asleep, each of this Pokemon's opponents receives damage equal to one-eighth of its max HP."},{"name":"Battle Armor","effect":"Critical Hits cannot strike this Pokemon."},{"name":"Big Pecks","effect":"This Pokemon's Defense cannot be lowered."},{"name":"Blaze","effect":"When its health reaches one-third or less of its max HP, this Pokemon's Fire-type attacks receive a 50% boost in power."},{"name":"Bulletproof","effect":"This Pokemon is immune to the effects of the bomb and ball-related moves Acid Spray, Aura Sphere, Barrage, Bullet Seed, Egg Bomb, Electro Ball, Energy Ball, Explosion, Focus Blast, Gyro Ball, Ice Ball, Magnet Bomb, Mist Ball, Mud Bomb, Octazooka, Rollout, Seed Bomb, Selfdestruct, Shadow Ball, Sludge Bomb and Weather Ball."},{"name":"Cheek Pouch","effect":"When this Pokemon's berry activates, it also restores HP."},{"name":"Chlorophyll","effect":"If this Pokemon is active while Sunny Day is in effect, its speed is temporarily doubled."},{"name":"Clear Body","effect":"Opponents cannot reduce this Pokemon's stats; they can, however, modify stat changes with Power Swap, Guard Swap and Heart Swap and inflict stat boosts with Swagger and Flatter. This ability does not prevent self-inflicted stat reductions."},{"name":"Cloud Nine","effect":"While this Pokemon is active, all weather conditions and their effects are disabled."},{"name":"Color Change","effect":"This Pokemon's type changes according to the type of the last move that hit this Pokemon."},{"name":"Competitive","effect":"When this Pokemon is hit with a stat-lowering move, its Special Attack increases by one level."},{"name":"Compound Eyes","effect":"The accuracy of this Pokemon's moves receives a 30% increase; for example, a 75% accurate move becomes 97.5% accurate.\r\n[Field Effect]  If this Pokemon is in the lead spot, the rate of wild Pokemon holding an item increases."},{"name":"Contrary","effect":"This Pokemon's stat modifiers, including self-inflicted ones, are reversed; i.e., negative modifiers become positive while positive ones become negative."},{"name":"Cursed Body","effect":"When this Pokemon is attacked, there is a 30% chance that the opponent's attack will be disabled."},{"name":"Cute Charm","effect":"When this Pokemon is attacked, there is a 30% chance that the opponent's attack will be disabled."},{"name":"Damp","effect":"While this Pokemon is active, no Pokemon on the field can use Selfdestruct or Explosion."},{"name":"Dark Aura","effect":"This Pokemon receives a power boost for Dark-type moves."},{"name":"Defeatist","effect":"When this Pokemon's HP falls below 50%, its Attack and Special Attack stats are halved."},{"name":"Defiant","effect":"This Pokemon's Attack rises by 2 stages when an opponent lowers any of this Pokemon's stats."},{"name":"Download","effect":"If this Pokemon switches into an opponent with equal Defenses or higher Defense than Special Defense, this Pokemon's Special Attack receives a 50% boost. If this Pokemon switches into an opponent with higher Special Defense than Defense, this Pokemon's Attack receive a 50% boost."},{"name":"Drizzle","effect":"When this Pokemon enters the battlefield, it causes an automatic Rain Dance that lasts for five turns, or eight turns if the Pokemon is holding a Damp Rock."},{"name":"Drought","effect":"When this Pokemon enters the battlefield, it causes an automatic Sunny Day that lasts for five turns, or eight turns if the Pokemon is holding a Heat Rock."},{"name":"Dry Skin","effect":"This Pokemon absorbs Water attacks up to 25% of its maximum HP but receives an extra 25% damage from Fire attacks. If Sunny Day is in effect, this Pokemon takes damage equal to 12.5% of its maximum HP. If Rain Dance is in effect, this Pokemon recovers health equal to 12.5% of its maximum HP."},{"name":"Early Bird","effect":"This Pokemon will remain asleep for half as long as it normally would; this includes both opponent-induced sleep and user-induced sleep via Rest."},{"name":"Effect Spore","effect":"This Pokemon will remain asleep for half as long as it normally would; this includes both opponent-induced sleep and user-induced sleep via Rest."},{"name":"Fairy Aura","effect":"This Pokemon receives a power boost for Fairy-type moves."},{"name":"Filter","effect":"This Pokemon receives one-fourth reduced damage from Super Effective attacks."},{"name":"Flame Body","effect":"This Pokemon receives one-fourth reduced damage from Super Effective attacks."},{"name":"Flare Boost","effect":"This Pokemon's Special Attack increases by 50% when it is burned."},{"name":"Flash Fire","effect":"This Pokemon is immune to all Fire-type attacks; additionally, its own Fire-type attacks receive a 50% boost if a Fire-type move hits this Pokemon. Multiple boosts do not occur if this Pokemon is hit with multiple Fire-type attacks."},{"name":"Flower Gift","effect":"If this Pokemon is active while Sunny Day is in effect, its Attack and Special Defense stats (as well as its partner's stats in double battles) receive a 50% boost."},{"name":"Flower Veil","effect":"Prevents allied Grass Pokemon from having their stats lowered."},{"name":"Forecast","effect":"This Pokemon's type changes according to the current weather conditions: it becomes Fire-type during Sunny Day, Water-type during Rain Dance, Ice-type during Hail and remains its regular type otherwise."},{"name":"Forewarn","effect":"The move with the highest Base Power in the opponent's moveset is revealed."},{"name":"Friend Guard","effect":"This Pokemon receives 25% reduced damage from allies in Double or Triple Battles."},{"name":"Frisk","effect":"When this Pokemon enters the field, it identifies the opponent's held item; in double battles, the held item of an unrevealed, randomly selected opponent is identified."},{"name":"Fur Coat","effect":"This Pokemon receives half damage from physical attacks."},{"name":"Gale Wings","effect":"This Pokemon's Flying-type moves receive +1 priority."},{"name":"Gluttony","effect":"This Pokemon consumes its held berry when its health reaches 50% max HP or lower."},{"name":"Gooey","effect":"This Pokemon consumes its held berry when its health reaches 50% max HP or lower."},{"name":"Grass Pelt","effect":"This Pokemon receives a defence boost when the terrain is grassy."},{"name":"Guts","effect":"When this Pokemon is poisoned (including Toxic), burned, paralyzed or asleep (including self-induced Rest), its Attack stat receives a 50% boost; the burn status' Attack drop is also ignored."},{"name":"Harvest","effect":"When this Pokemon is poisoned (including Toxic), burned, paralyzed or asleep (including self-induced Rest), its Attack stat receives a 50% boost; the burn status' Attack drop is also ignored."},{"name":"Healer","effect":"The user has a 30% chance to heal its allies of status conditions in Double or Triple Battles."},{"name":"Heatproof","effect":"This Pokemon receives half damage from both Fire-type attacks and residual burn damage."},{"name":"Heavy Metal","effect":"This Pokemon's weight is doubled."},{"name":"Honey Gather","effect":"If it is not already holding an item, this Pokemon may find and be holding Honey after a battle."},{"name":"Huge Power","effect":"This Pokemon's Attack stat is doubled. Therefore, if this Pokemon's Attack stat on the status screen is 200, it effectively has an Attack stat of 400; which is then subject to the full range of stat boosts and reductions."},{"name":"Hustle","effect":"This Pokemon's Attack receives a 50% boost but its Physical attacks receive a 20% drop in Accuracy. For example, a 100% accurate move would become an 80% accurate move. The accuracy of moves that never miss, such as Aerial Ace, remains unaffected.\r\n[Field Effect]  If this Pokemon is in the lead spot, the rate of wild Pokemon battles decreases."},{"name":"Hydration","effect":"If this Pokemon is active while Rain Dance is in effect, it recovers from poison, paralysis, burn, sleep and freeze at the end of the turn."},{"name":"Hyper Cutter","effect":"Opponents cannot reduce this Pokemon's Attack stat; they can, however, modify stat changes with Power Swap or Heart Swap and inflict a stat boost with Swagger. This ability does not prevent self-inflicted stat reductions."},{"name":"Ice Body","effect":"If active while Hail is in effect, this Pokemon recovers one-sixteenth of its max HP after each turn. If a non-Ice-type Pokemon receives this ability through Skill Swap, Role Play or the Trace ability, it will not take damage from Hail."},{"name":"Illuminate","effect":"When this Pokemon is in the first slot of the player's party, it doubles the rate of wild encounters."},{"name":"Illusion","effect":"This Pokemon takes on the appearance, name, gender and Pokeball of the last Pokemon in the player's party."},{"name":"Immunity","effect":"This Pokemon cannot become poisoned nor Toxic poisoned."},{"name":"Imposter","effect":"This Pokemon Transforms into the opponent upon entering the field."},{"name":"Infiltrator","effect":"This Pokemon ignore certain effects of the opponent's, such as Safeguard, Reflect and Light Screen."},{"name":"Inner Focus","effect":"This Pokemon cannot be made to flinch."},{"name":"Insomnia","effect":"This Pokemon cannot be put to sleep; this includes both opponent-induced sleep as well as user-induced sleep via Rest."},{"name":"Intimidate","effect":"When this Pokemon enters the field, the Attack stat of each of its opponents lowers by one stage.\r\n[Field Effect]  If this Pokemon is in the lead spot, the rate of wild Pokemon battles, whose level is at least 5 levels less than that of this Pokemon, halves."},{"name":"Iron Barbs","effect":"When this Pokemon enters the field, the Attack stat of each of its opponents lowers by one stage.\r\n[Field Effect]  If this Pokemon is in the lead spot, the rate of wild Pokemon battles, whose level is at least 5 levels less than that of this Pokemon, halves."},{"name":"Iron Fist","effect":"This Pokemon receives a 20% power boost for the following attacks: Bullet Punch, Comet Punch, Dizzy Punch, Drain Punch, Dynamicpunch, Fire Punch, Focus Punch, Hammer Arm, Ice Punch, Mach Punch, Mega Punch, Meteor Mash, Shadow Punch, Sky Uppercut, and Thunderpunch. Sucker Punch, which is known Ambush in Japan, is not boosted."},{"name":"Justified","effect":"When Dark-type moves hit this Pokemon, its Attack increases by one level."},{"name":"Keen Eye","effect":"This Pokemon's Accuracy cannot be lowered.\r\n[Field Effect]  If this Pokemon is in the lead spot, the rate of low-leveled wild Pokemon battles decreases."},{"name":"Klutz","effect":"This Pokemon ignores both the positive and negative effects of its held item, other than the speed-halving effects of Iron Ball and the seven EV training items."},{"name":"Leaf Guard","effect":"If this Pokemon is active while Sunny Day is in effect, it cannot become poisoned, burned, paralyzed or put to sleep (other than user-induced Rest). Leaf Guard does not heal status effects that existed before Sunny Day came into effect."},{"name":"Levitate","effect":"This Pokemon is immune to Ground-type attacks, Spikes, Toxic Spikes and the Arena Trap ability; it loses these immunities while holding Iron Ball, after using Ingrain or if Gravity is in effect."},{"name":"Light Metal","effect":"This Pokemon's weight is halved."},{"name":"Lightning Rod","effect":"During double battles, this Pokemon draws any single-target Electric-type attack to itself; when hit by a Electric-type move, this Pokemon does not take damage and its Special Attack increases by one level. If an opponent uses an Electric-type attack that affects multiple Pokemon, those targets will be hit. This ability does not affect Electric Hidden Power or Judgment."},{"name":"Limber","effect":"This Pokemon cannot become paralyzed."},{"name":"Liquid Ooze","effect":"When another Pokemon uses Absorb, Drain Punch, Dream Eater, Giga Drain, Leech Life, Leech Seed or Mega Drain against this Pokemon, the attacking Pokemon loses the amount of health that it would have gained."},{"name":"Magic Bounce","effect":"When another Pokemon uses Absorb, Drain Punch, Dream Eater, Giga Drain, Leech Life, Leech Seed or Mega Drain against this Pokemon, the attacking Pokemon loses the amount of health that it would have gained."},{"name":"Magic Guard","effect":"Prevents all damage except from direct attacks."},{"name":"Magician","effect":"This Pokemon steals the held item of a Pokemon it hits with a move, as long as it is not currently holding an item."},{"name":"Magma Armor","effect":"This Pokemon cannot become frozen.\r\n[Field Effect]  Pokemon Eggs hatch in half the time"},{"name":"Magnet Pull","effect":"When this Pokemon enters the field, Steel-type opponents cannot switch out nor flee the battle unless they are holding Shed Shell or use the attacks U-Turn or Baton Pass.\r\n[Field Effect]  If this Pokemon is in the lead spot, the rate of encountering a Steel-type Pokemon increases by 50%."},{"name":"Marvel Scale","effect":"When this Pokemon becomes burned, poisoned (including Toxic), paralyzed, frozen or put to sleep (including self-induced sleep via Rest), its Defense receives a 50% boost."},{"name":"Mega Launcher","effect":"This Pokemon receives a power boost for the following aura and pulse-related moves Aura Sphere, Dark Pulse, Dragon Pulse, Heal Pulse and Water Pulse."},{"name":"Minus","effect":"This Pokemon's Special Attack receives a 50% boost in double battles if its partner has the Plus ability."},{"name":"Mold Breaker","effect":"When this Pokemon becomes active, it nullifies the abilities of opposing active Pokemon that hinder this Pokemon's attacks. These abilities include Battle Armor, Clear Body, Damp, Dry Skin, Filter, Flash Fire, Flower Gift, Heatproof, Hyper Cutter, Immunity, Inner Focus, Insomnia, Keen Eye, Leaf Guard, Levitate, Lightningrod, Limber, Magma Armor, Marvel Scale, Motor Drive, Oblivious, Own Tempo, Sand Veil, Shell Armor, Shield Dust, Simple, Snow Cloak, Solid Rock, Soundproof, Sticky Hold, Storm Drain, Sturdy, Suction Cups, Tangled Feet, Thick Fat, Unaware, Vital Spirit, Volt Absorb, Water Absorb, Water Veil, White Smoke and Wonder Guard."},{"name":"Moody","effect":"After every turn, one of this Pokemon's stats is increased by two stages while another stat is decreased by one stage. These stats include Accuracy and Evasion."},{"name":"Motor Drive","effect":"This Pokemon is immune to all Electric-type attacks, including Thunder Wave, and if an Electric-type attack hits this Pokemon, it receives a one-level Speed boost."},{"name":"Moxie","effect":"When this Pokemon knocks out another Pokemon, its Attack is raised by one level."},{"name":"Multiscale","effect":"When this Pokemon is at full health, it takes halved damage from attacks."},{"name":"Multitype","effect":"When this Pokemon is at full health, it takes halved damage from attacks."},{"name":"Mummy","effect":"When this Pokemon is hit with a contact move, or if this Pokemon hits another Pokemon with a contact move, the other Pokemon's ability becomes Mummy, unless it has Multitype or Wonder Guard."},{"name":"Natural Cure","effect":"When this Pokemon switches out of battle, it is cured of poison (including Toxic), paralysis, burn, freeze and sleep (including self-induced Rest)."},{"name":"No Guard","effect":"Both this Pokemon and the opponent will have 100% accuracy for any attack.\r\n[Field Effect]  If Pokemon is in the lead slot, wild encounters will increase."},{"name":"Normalize","effect":"Makes all of this Pokemon's attacks Normal-typed."},{"name":"Oblivious","effect":"This Pokemon cannot become attracted to another Pokemon."},{"name":"Overcoat","effect":"This Pokemon is immune to the residual damage of Hail and Sandstorm."},{"name":"Overgrow","effect":"When its health reaches one-third or less of its max HP, this Pokemon's Grass-type attacks receive a 50% boost in power."},{"name":"Own Tempo","effect":"This Pokemon cannot become confused."},{"name":"Parental Bond","effect":"This Pokemon attacks twice in one turn."},{"name":"Pickpocket","effect":"When another Pokemon makes contact with this Pokemon, its hold item is stolen unless this Pokemon is already holding an item."},{"name":"Pickup","effect":"When another Pokemon makes contact with this Pokemon, its hold item is stolen unless this Pokemon is already holding an item."},{"name":"Pixilate","effect":"All of this Pokemon's Normal-typed moves are now Fairy-type."},{"name":"Plus","effect":"This Pokemon's Special Attack receives a 50% boost in double battles if its partner has the Minus ability."},{"name":"Poison Heal","effect":"If this Pokemon become poisoned or Toxic Poisoned, it will recover one-eighth of its max HP after each turn. However, this Pokemon will continue to lose health as the player walks on the overworld screen."},{"name":"Poison Point","effect":"If this Pokemon become poisoned or Toxic Poisoned, it will recover one-eighth of its max HP after each turn. However, this Pokemon will continue to lose health as the player walks on the overworld screen."},{"name":"Poison Touch","effect":"This Pokemon has a 20% chance to inflict Poison if it makes contact with its target."},{"name":"Prankster","effect":"The non-damaging moves of this Pokemon have one priority stage higher than usual."},{"name":"Pressure","effect":"When an opponent uses a move that affects this Pokemon, an additional PP is required for the opponent to use that move.\r\n[Field Effect]  If this Pokemon is in the lead spot, the rate of wild Pokemon battles is halved."},{"name":"Protean","effect":"This Pokemon changes type to the type of whatever move it just used."},{"name":"Pure Power","effect":"This Pokemon's Attack stat is doubled. Therefore, if this Pokemon's Attack stat on the status screen is 200, it effectively has an Attack stat of 400; which is then subject to the full range of stat boosts and reductions."},{"name":"Quick Feet","effect":"When this Pokemon is poisoned (including Toxic), burned, paralyzed, asleep (including self-induced Rest) or frozen, its Speed stat receives a 50% boost; the paralysis status' Speed drop is also ignored.\r\n[Field Effect]  If Pokemon is in lead slot, wild encounters decrease."},{"name":"Rain Dish","effect":"If active while Rain Dance is in effect, this Pokemon recovers one-sixteenth of its max HP after each turn."},{"name":"Rattled","effect":"When Bug-, Dark- or Ghost-type attacks hit this Pokemon, its Speed increases by one level."},{"name":"Reckless","effect":"When this Pokemon uses an attack that causes recoil damage, or an attack that has a chance to cause recoil damage such as Jump Kick and Hi Jump Kick, the attacks's power receives a 20% boost."},{"name":"Refrigerate","effect":"All of this Pokemon's Normal-typed moves are now Ice-type."},{"name":"Regenerator","effect":"When this Pokemon switches out, it recovers 1\/3 of its max HP."},{"name":"Rivalry","effect":"Increases base power of Physical and Special attacks by 25% if the opponent is the same gender, but decreases base power by 25% if opponent is the opposite gender."},{"name":"Rock Head","effect":"This Pokemon does not receive recoil damage unless it uses Struggle, it misses with Jump Kick or Hi Jump Kick or it is holding Life Orb, Jaboca Berry or Rowap Berry."},{"name":"Rough Skin","effect":"This Pokemon does not receive recoil damage unless it uses Struggle, it misses with Jump Kick or Hi Jump Kick or it is holding Life Orb, Jaboca Berry or Rowap Berry."},{"name":"Run Away","effect":"Unless this Pokemon is under the effects of a trapping move or ability, such as Mean Look or Shadow Tag, it will escape from wild Pokemon battles without fail."},{"name":"Sand Force","effect":"The power of this Pokemon's Rock-, Ground- and Steel-type moves increases by 30% during Sandstorm. This Pokemon is also immune to the residual damage of Sandstorm."},{"name":"Sand Rush","effect":"This Pokemon's Speed doubles during Sandstorm. This Pokemon is also immune to the residual damage of Sandstorm."},{"name":"Sand Stream","effect":"When this Pokemon enters the battlefield, it causes an automatic Sandstorm that lasts for five turns, or eight turns if the Pokemon is holding a Smooth Rock."},{"name":"Sand Veil","effect":"If active while Sandstorm is in effect, this Pokemon's Evasion receives a 20% boost; if this Pokemon has a typing that would normally take damage from Sandstorm, this Pokemon is also immune to Sandstorm's damage.\r\n[Field Effect]  If this Pokemon is in the lead spot, the rate of wild Pokemon battles during a Sandstorm is halved."},{"name":"Sap Sipper","effect":"This Pokemon takes no damage from Grass-type moves, and, if hit by one, its Attack is raised by one level."},{"name":"Scrappy","effect":"This Pokemon has the ability to hit Ghost-type Pokemon with Normal-type and Fighting-type moves. Effectiveness of these moves takes into account the Ghost-type Pokemon's other weaknesses and resistances."},{"name":"Serene Grace","effect":"The side effects of this Pokemon's attack occur twice as often. For example, if this Pokemon uses Ice Beam, it will have a 20% chance to freeze its target."},{"name":"Shadow Tag","effect":"When this Pokemon enters the field, its opponents cannot switch or flee the battle unless they have the same ability, are holding Shed Shell, or they use the moves Baton Pass or U-Turn."},{"name":"Shed Skin","effect":"After each turn, this Pokemon has a 33% chance to heal itself from poison (including Toxic), paralysis, burn, freeze or sleep (including self-induced Rest)."},{"name":"Sheer Force","effect":"When this Pokemon uses an attack that has secondary effects, the move receives a 30% Power boost but it cannot trigger the secondary effect."},{"name":"Shell Armor","effect":"Critical Hits cannot strike this Pokemon."},{"name":"Shield Dust","effect":"If the opponent uses a move that has secondary effects that affect this Pokemon in addition to damage, the move's secondary effects will not trigger. (For example, an Ice Beam will lose its 10% chance to freeze this Pokemon.)"},{"name":"Simple","effect":"This Pokemon doubles all of its positive and negative stat modifiers. For example, if this Pokemon uses Curse, its Attack and Defense stats each receive a two-level increase while its Speed stat receives a two-level decrease."},{"name":"Skill Link","effect":"When this Pokemon uses an attack that strikes multiple times in one turn, such as Fury Attack or Spike Cannon, such attacks will always strike for the maximum number of hits."},{"name":"Slow Start","effect":"After this Pokemon switches into the battle, its Attack and Speed stats are halved for five turns; for example, if this Pokemon has an Attack stat of 400, it will effectively have an Attack stat of 200 until the effects of Slow Start wear off."},{"name":"Sniper","effect":"When this Pokemon lands a Critical Hit, the base power of its attack tripled rather than doubled."},{"name":"Snow Cloak","effect":"If active while Hail is in effect, this Pokemon's Evasion receives a 20% boost; if this Pokemon has a typing that would normally take damage from Hail, this Pokemon is also immune to Hail's damage."},{"name":"Snow Warning","effect":"When this Pokemon enters the battlefield, it causes an automatic Hail that lasts for five turns, or eight turns if the Pokemon is holding an Icy Rock."},{"name":"Solar Power","effect":"If this Pokemon is active while Sunny Day is in effect, its Special Attack temporarily receives a 50% boost but this Pokemon also receives damage equal to one-eighth of its max HP after each turn."},{"name":"Solid Rock","effect":"This Pokemon receives one-fourth reduced damage from Super Effective attacks."},{"name":"Soundproof","effect":"This Pokemon is immune to the effects of the sound-related moves Boomburst, Bug Buzz, Chatter, Disarming Voice, Grasswhistle, Growl, Heal Bell, Hyper Voice, Metal Sound, Noble Roar, Perish Song, Roar, Roar of Time, Sing, Sonicboom, Supersonic, Screech, Snore and Uproar."},{"name":"Speed Boost","effect":"While this Pokemon is active, its Speed increased by one stage at the end of every turn; the six stage maximum for stat boosts is still in effect."},{"name":"Stall","effect":"While this Pokemon is active, its Speed increased by one stage at the end of every turn; the six stage maximum for stat boosts is still in effect."},{"name":"Stance Change","effect":"This Pokemon changes forme based on whether it uses offensive or defensive moves."},{"name":"Static","effect":"This Pokemon changes forme based on whether it uses offensive or defensive moves."},{"name":"Steadfast","effect":"If this Pokemon is made to flinch, its Speed receives a one-level boost."},{"name":"Stench","effect":"When this Pokemon is in the first slot of the player's party, it halves the rate of wild encounters. Additionally, this Pokemon's damaging moves have a 10% chance to make the target flinch."},{"name":"Sticky Hold","effect":"Opponents cannot remove items from this Pokemon.\r\n[Field Effect]  Pokemon hooked by a fishing rod are easier to catch."},{"name":"Storm Drain","effect":"During double battles, this Pokemon draws any single-target Water-type attack to itself; when hit by a Water-type move, this Pokemon does not take damage and its Special Attack increases by one level. If an opponent uses an Water-type attack that affects multiple Pokemon, those targets will be hit. This ability does not affect Water Hidden Power, Judgment or Weather Ball."},{"name":"Strong Jaw","effect":"This Pokemon receives a power boost for the following bite-related moves Bite, Bug Bite, Crunch, Fire Fang, Hyper Fang, Ice Fang, Poison Fang and Thunder Fang."},{"name":"Sturdy","effect":"The one-hit KO moves Fissure, Guillotine, Horn Drill and Sheer Cold do not affect this Pokemon. Also, if the Pokemon is at full health and an attack normally would knock that Pokemon out, it retains 1 HP and does not faint."},{"name":"Suction Cups","effect":"Roar and Whirlwind do not affect this Pokemon.\r\n[Field Effect]  Pokemon hooked by a fishing rod are easier to catch."},{"name":"Super Luck","effect":"Raises the chance of this Pokemon scoring a Critical Hit."},{"name":"Swarm","effect":"When its health reaches one-third or less of its max HP, this Pokemon's Bug-type attacks receive a 50% boost in power.\r\n[Field Effect]  Pokemon cries are heard more often."},{"name":"Sweet Veil","effect":"Prevents allied Pokemon from being put to sleep."},{"name":"Swift Swim","effect":"If this Pokemon is active while Rain Dance is in effect, its speed is temporarily doubled."},{"name":"Symbiosis","effect":"This Pokemon can pass an item to an ally."},{"name":"Synchronize","effect":"If an opponent burns, poisons or paralyzes this Pokemon, the same condition inflicts the opponent.\r\n[Field Effect]  If this Pokemon is in the lead spot, the rate of encountering a Pokemon with the same nature increases by 50%"},{"name":"Tangled Feet","effect":"When this Pokemon is confused, its opponent's attacks have a 50% chance of missing."},{"name":"Technician","effect":"When this Pokemon uses an attack that has 60 Base Power or less, the move's Base Power receives a 50% boost. For example, a move with 60 Base Power effectively becomes a move with 90 Base Power."},{"name":"Telepathy","effect":"This Pokemon avoids damage from its teammates in Double or Triple Battles."},{"name":"Teravolt","effect":"When this Pokemon becomes active, it nullifies the abilities of opposing active Pokemon that hinder this Pokemon's attacks. These abilities include Battle Armor, Clear Body, Damp, Dry Skin, Filter, Flash Fire, Flower Gift, Heatproof, Hyper Cutter, Immunity, Inner Focus, Insomnia, Keen Eye, Leaf Guard, Levitate, Lightningrod, Limber, Magma Armor, Marvel Scale, Motor Drive, Oblivious, Own Tempo, Sand Veil, Shell Armor, Shield Dust, Simple, Snow Cloak, Solid Rock, Soundproof, Sticky Hold, Storm Drain, Sturdy, Suction Cups, Tangled Feet, Thick Fat, Unaware, Vital Spirit, Volt Absorb, Water Absorb, Water Veil, White Smoke and Wonder Guard."},{"name":"Thick Fat","effect":"This Pokemon receives halved damage from Ice-type and Fire-type attacks."},{"name":"Tinted Lens","effect":"Doubles the power of moves that are Not Very Effective against opponents."},{"name":"Torrent","effect":"When its health reaches one-third or less of its max HP, this Pokemon's Water-type attacks receive a 50% boost in power."},{"name":"Tough Claws","effect":"When its health reaches one-third or less of its max HP, this Pokemon's Water-type attacks receive a 50% boost in power."},{"name":"Toxic Boost","effect":"This Pokemon's Attack increases by 50% when it is poisoned."},{"name":"Trace","effect":"When this Pokemon enters the field, it temporarily copies an opponent's ability (except Multitype). This ability remains with this Pokemon until it leaves the field."},{"name":"Truant","effect":"After this Pokemon is switched into battle, it skips every other turn."},{"name":"Turboblaze","effect":"When this Pokemon becomes active, it nullifies the abilities of opposing active Pokemon that hinder this Pokemon's attacks. These abilities include Battle Armor, Clear Body, Damp, Dry Skin, Filter, Flash Fire, Flower Gift, Heatproof, Hyper Cutter, Immunity, Inner Focus, Insomnia, Keen Eye, Leaf Guard, Levitate, Lightningrod, Limber, Magma Armor, Marvel Scale, Motor Drive, Oblivious, Own Tempo, Sand Veil, Shell Armor, Shield Dust, Simple, Snow Cloak, Solid Rock, Soundproof, Sticky Hold, Storm Drain, Sturdy, Suction Cups, Tangled Feet, Thick Fat, Unaware, Vital Spirit, Volt Absorb, Water Absorb, Water Veil, White Smoke and Wonder Guard."},{"name":"Unaware","effect":"This Pokemon ignores an opponent's stat boosts for Attack, Defense, Special Attack and Special Defense. These boosts will still be calculated if this Pokemon uses Punishment."},{"name":"Unburden","effect":"Increases Speed by one level if this Pokemon loses its held item through usage (i.e. Berries) or via Thief, Knock Off, etc."},{"name":"Unnerve","effect":"The opponent cannot consume its Berry."},{"name":"Victory Star","effect":"The Accuracy of this Pokemon and its partners in Double and Triple Battles receives a 10% boost."},{"name":"Vital Spirit","effect":"This Pokemon cannot be put to sleep; this includes both opponent-induced sleep as well as user-induced sleep via Rest.\r\n[Field Effect]  If this Pokemon is in the lead spot, the rate of high-levelled wild Pokemon battles decreases by 50%."},{"name":"Volt Absorb","effect":"When an Electric-type attack hits this Pokemon, it recovers health equal to the damage that it would have taken; this Pokemon can recover up to 25% of its max HP in this way."},{"name":"Water Absorb","effect":"When a Water-type attack hits this Pokemon, it recovers health equal to the damage that it would have taken; this Pokemon can recover up to 25% of its max HP in this way."},{"name":"Water Veil","effect":"This Pokemon cannot become burned."},{"name":"Weak Armor","effect":"When Physical attacks hit this Pokemon, its Defense decreases by one stage while its Speed increases by one stage."},{"name":"White Smoke","effect":"Opponents cannot reduce this Pokemon's stats; they can, however, modify stat changes with Power Swap, Guard Swap and Heart Swap and inflict stat boosts with Swagger and Flatter. This ability does not prevent self-inflicted stat reductions.\r\n[Field Effect]  If this Pokemon is in the lead spot, the rate of wild Pokemon battles decreases by 50%."},{"name":"Wonder Guard","effect":"This Pokemon only receives damage from attacks belonging to types that cause Super Effective to this Pokemon. Wonder Guard does not protect a Pokemon from status ailments (burn, freeze, paralysis, poison, sleep, Toxic or any of their side effects or damage), recoil damage nor the moves Beat Up, Bide, Doom Desire, Fire Fang, Future Sight, Hail, Leech Seed, Sandstorm, Spikes, Stealth Rock and Struggle. Wonder Guard cannot be Skill Swapped nor Role Played. Trace, however, does copy Wonder Guard."},{"name":"Wonder Skin","effect":"Halves the chance that a non-damaging move will inflict its effect on this Pokemon."},{"name":"Zen Mode","effect":"When this Pokemon falls below 50% of its maximum HP, it changes to its Zen Form."}]